I confirmed this worked with subnet-level permissions explicitly with the below repro (infra/main.tf with a highly permissioned account, and application/main.tf with the SA created in infra/main.tf), and project-level permissions were confirmed above. I believe you need specific permissions against the subnetwork or host project with the principal performing the attachment- typically `roles/compute.networkUser` as I used here.

### infra/main.tf

```terraform
resource "google_project" "host" {
  name = "test-host-project-4365658483"
  project_id = "test-host-project-4365658483"
  org_id = "<org>"
  billing_account = "<ba>"
}

resource "google_project_service" "host_compute" {
  project = google_project.host.project_id
  service = "compute.googleapis.com"
  disable_on_destroy = false
}

resource "google_compute_shared_vpc_host_project" "host" {
  project = google_project.host.project_id
  depends_on = [google_project_service.host_compute]
}


resource "google_project" "service" {
  name       = "test-service-project-1243325"
  project_id = "test-service-project-1243325"
  org_id = "<org>"
  billing_account = "<ba>"
}

resource "google_project_service" "service_compute" {
  project = google_project.service.project_id
  service = "compute.googleapis.com"
  disable_on_destroy = false
}

resource "google_service_account" "service_account" {
  account_id   = "service-account-id"
  display_name = "Service Account"
  project = google_project.service.project_id
}

# Use a more granular permission!
resource "google_project_iam_member" "sa_editor" {
  project = google_project.service.project_id
  role = "roles/editor"
  member = google_service_account.service_account.member
}

resource "google_compute_shared_vpc_service_project" "service" {
  host_project    = google_compute_shared_vpc_host_project.host.project
  service_project = google_project.service.project_id
  depends_on = [google_project_service.host_compute, google_project_service.service_compute]
}

resource "google_compute_subnetwork_iam_member" "member" {
  project = google_project.host.project_id
  region = "us-central1"
  subnetwork = "default"
  role = "roles/compute.networkUser"
  member = google_service_account.service_account.member

  depends_on = [google_project_service.host_compute]
}

# not strictly necessary for the repro, but makes it easy to impersonate
resource "google_service_account_iam_member" "add-impersonation-permissions" {
  service_account_id = google_service_account.service_account.id

  member             = "user:<email>"
  role               = "roles/iam.serviceAccountTokenCreator"
}
```

### application/main.tf

```terraform
resource "google_compute_instance" "instance" {
  name         = "my-machine"
  zone         = "us-central1-f"
  project      = "test-service-project-1243325"
  machine_type = "e2-medium"

  boot_disk {
    initialize_params {
      image = "debian-cloud/debian-11"
    }
  }

  network_interface {
    subnetwork         = "default"
    subnetwork_project = "test-host-project-4365658483"
  }
}
```

### terraform apply

```
$ GOOGLE_IMPERSONATE_SERVICE_ACCOUNT=service-account-id@test-service-project-1243325.iam.gserviceaccount.com terraform apply

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_instance.instance will be created
  + resource "google_compute_instance" "instance" {
      + can_ip_forward       = false
      + cpu_platform         = (known after apply)
      + creation_timestamp   = (known after apply)
      + current_status       = (known after apply)
      + deletion_protection  = false
      + effective_labels     = {
          + "goog-terraform-provisioned" = "true"
        }
      + id                   = (known after apply)
      + instance_id          = (known after apply)
      + label_fingerprint    = (known after apply)
      + machine_type         = "e2-medium"
      + metadata_fingerprint = (known after apply)
      + min_cpu_platform     = (known after apply)
      + name                 = "my-machine"
      + project              = "test-service-project-1243325"
      + self_link            = (known after apply)
      + tags_fingerprint     = (known after apply)
      + terraform_labels     = {
          + "goog-terraform-provisioned" = "true"
        }
      + zone                 = "us-central1-f"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + guest_os_features          = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + architecture           = (known after apply)
              + image                  = "debian-cloud/debian-11"
              + labels                 = (known after apply)
              + provisioned_iops       = (known after apply)
              + provisioned_throughput = (known after apply)
              + resource_policies      = (known after apply)
              + size                   = (known after apply)
              + snapshot               = (known after apply)
              + type                   = (known after apply)
            }
        }

      + network_interface {
          + internal_ipv6_prefix_length = (known after apply)
          + ipv6_access_type            = (known after apply)
          + ipv6_address                = (known after apply)
          + name                        = (known after apply)
          + network                     = (known after apply)
          + network_attachment          = (known after apply)
          + network_ip                  = (known after apply)
          + stack_type                  = (known after apply)
          + subnetwork                  = "default"
          + subnetwork_project          = "test-host-project-4365658483"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

google_compute_instance.instance: Creating...
google_compute_instance.instance: Still creating... [10s elapsed]
google_compute_instance.instance: Still creating... [20s elapsed]
google_compute_instance.instance: Creation complete after 29s [id=projects/test-service-project-1243325/zones/us-central1-f/instances/my-machine]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```

From https://console.cloud.google.com/compute/instancesDetail/zones/us-central1-f/instances/my-machine?inv=1&invt=Abts7A&project=test-service-project-1243325

<img width="1062" alt="Image" src="https://github.com/user-attachments/assets/2cc87792-684f-454d-b5ee-e319de6deb70" />

 